<template>
  <div>
    <van-action-sheet v-model="show" title="京东物流-电子运单契约条款">
      <div class="content">
        <div v-for="item in content " class="content_text">
          <div
              :style="`color: ${item.color};`"
              v-html="item.text"
          >
          </div>
        </div>
      </div>
      <div class="footer">
        <div class="confirm_tips">
          <div @click="btnTips" class="btn-tips" :class="{'btn-tips-true' :(btn === 1)}">
            <van-icon v-if="btn === 1" style="transform: translate(0,7%)" name="success"/>
          </div>
          <span>同意<span class="text-tips">《电子运单契约条款》</span></span>
        </div>
      </div>
    </van-action-sheet>
  </div>

</template>

<script>
export default {
  name: "index",
  props:{
    btn:0,
  },
  data() {
    return{
      show: false,
      content: [
        { text: '  《快件服务协议》是京东物流与寄件人（以下简称“您”）之间达成的快件寄递服务合同，附则、运单、隐私协议及京东物流已经发布或将发布的各类规则为《快件服务协议》有效组成部分（以下统称为“本协议”）， 请您在填写运单前仔细阅读。京东物流有权随时对本协议内容进行变更，您可以登录京东物流官方网站【www.jdwl.com】或拨打京东物流客服热线（950616）咨询；若您在本协议内容变更后继续使用本服务，表示您已充分阅读、理解并接受修改后的条款内容； 若您不同意本协议或修改后的条款内容，您应停止使用本服务。'+'</br>'  },
        { text: '1、 说明' +'</br>' +
              '“京东物流”指北京京邦达贸易有限公司及其子公司、分公司、关联公司， 并依据本协议为您提供快递服务。本协议的缔约主体是您与寄件地的北京京邦达贸易有限公司的子公司、分公司、关联公司。\n快件”指单个运单中，京东物流同意收寄的托寄物。' },
        { color: '#ff0000', text: '2、 寄件人的义务' +'</br>' +
              '2.1 请您提交本人真实信息登录京东物流账号，并妥善保管该等账号，通过您的账号进行的下单等操作行为视为您本人行为，您确认现场交付快件为您本人或已获得您完全授权人员。</br>' +
              '2.2 您需承诺您是托寄物的合法处置人，保证对货物享有所有权或独立处分权。</br>' +
              '2.3请您如实填写或提供运单所有信息包括但不限于托寄物名称、性质、数量和价值，以及寄件人、收件人的名称、地址、联系电话，并保证该等资料都是真实、完整和准确的。</br>' +
              '2.4 您应确保快件在准备、仓储和运输过程中京东物流免受他人不当干扰。</br>' +
              '2.5 您在交付寄递前需对快件进行妥善包装，适用于正常安全运输；尤其是易碎品、液体、气体，您需提供充分的防破损、防漏、防爆措施。</br>' +
              '2.6 遵守法律法规的规定，不予寄递国家法律法规规定的禁运物品或限运物品，您可通过下单页面及本协议附录一、二、三查询禁寄品名录。附录一、二、三为国家邮政局等监管机构发布的有关禁止寄递物品管理规定及禁寄品名录，若该等规范性法律文件发生变更，京东物流将按有关监管机构发布及更新的最新规定为准。</br>' +
              '京东物流在任何时候发现你交付的物品属于禁止或限制寄递的物品，有权移交相关部门处理。</br>' +
              '2.7 托寄物需要办理审批、检验等手续的，您应向京东物流提交办理完相关手续的证明文件。</br>' +
              '2.8 出示有效证件。' },
        { text: '3、 京东物流的义务' +'</br>' +
              '出于安全及法律法规的要求，京东物流有权对快件进行当场开箱验视及安全检查。免生疑问，京东物流不会对因上述查验而导致的任何延误造成的损失负责。对禁寄及拒绝验视的快件不予收寄。</br>' +
              '京东物流向寄件人提供自交寄之日起一年内的查询服务。' },
        { text: '4、 费用' +'</br>' +
              '4.1 快件服务的运费及附加服务费的计费标准以京东物流官方网站上所公示的当期计费标准为准，京东物流可以根据市场环境的变化不时的合理变更价格，您可以登录京东物流官方网站查询或拨打京东物流客服热线咨询。</br>' +
              '4.2 附加服务费</br>' +
              '您指示在物流中心、保税区等需要支付出/入仓费或其他额外费用的特殊地址收取或派送快件时，您或您指定付款人应当偿还京东物流垫付的额外费用，并向京东物流支付附加服务费。京东物流在春节、十一等法定节假日和“618”“双十一”等业务高峰期间提供服务的，需加收附加服务费。</br>' +
              '如地址不正确、联系方式错误、收件人拒收等原因而造成无法派送的快件，若您要求退回，则双程费用均由您承担。</br>' +
              '4.3 寄件人始终对所有费用承担主要责任。在寄件人指示由收件人或第三方付费的情况下，寄件人应向京东物流支付收件人或第三方应支付但未支付的所有运费和其它费用。若京东物流代表寄件人、收件人或任何第三方被要求缴纳税费，且京东物流无法从相关人士收回该金额，寄件人将按要求支付该金额。</br>' +
              '4.4 若您或您指定的付款人未付清费用的，京东物流有权留置托寄物，留置期限为3个月（自揽收快件之日起计算），但托寄物性质不能留置的除外。京东物流将通过电话等方式通知您配合京东物流行使留置权的，通知发出后7日内您未书面答复京东物流的，视为您同意京东物流行使留置权的方案。京东物流行使留置权，不影响京东物流在法律允许的范围内根据本合同享有的其他权益。</br>' +
              '4.5 无法派送的快件，京东物流会联系您处理，若您指示放弃货物，京东物流取得该货物处置权限。若发生以下事项之一，京东物流将对快件保存6个月（不易保存的除外），并向您收取保管费，期限届满，京东物流有权依据国家相关法律法规等规定对快件进行处理。</br>' +
              '1） 京东物流联系不到您；</br>' +
              '2） 在京东物流通知的时间内您未给出明确的指示；</br>' +
              '3） 您指示退回，但在京东物流退货时，因您的指示不正确或联系不到，导致无法派送退件；' },
        { color: '#ff0000',text: '5、 保价与赔偿' +'</br>' +
              '5.1 因京东物流原因，快件发生损毁或丢失，免除本次运费（不含保价等附加费用），并按以下标准进行赔偿。</br>' +
              '5.2 若您未选择保价，则本公司在九倍运费的限额内向您赔偿托寄物的实际损失。如您认为该赔偿标准，不足以弥补您的损失，应根据托寄物的实际价值选择等值的保价服务。</br>' +
              '5.3 若您选择保价且支付保价费用的，则本公司按照保价金额和损失的比例向您赔偿，最高不超过托寄物的实际损失金额。</br>' +
              '5.4 保价但未填写内件价值、未保价且无法提供有效价值证明的，或未缴纳保价费用,视为未保价，按照5.2条赔偿；</br>' +
              '5.5 京东物流为您提供保价服务，价值超过1000元的物品请您保价，最高可保价值300000元以下物品。</br>' +
              '5.6 保价手续费按照保价金额的一定比例收取,具体收取比例以京东物流官网公示的当期标准为准。</br>' +
              '5.7 京东物流采取“理赔审查”的方式，您应在寄件时如实按照托寄物的实际价值诚信保价，理赔时提供相关价值证明，京东物流将按保价金额和损失的比例进行赔偿，超额保价部分无法获得赔偿，京东物流可以退还相关费用。</br>' +
              '5.8 京东物流基于本协议对寄件人您所承担的责任仅限于实际直接损失且不超过本协议所规定的限额。但不承担您可能获得的收益、实际用途、商业机会等任何间接损失。</br>' +
              '5.9 京东物流若按托寄物全部灭失进行理赔后，但托寄物尚有残值的，由京东物流与您协商处理，如残值归您所有，京东物流有权在全部赔偿金额中直接扣减残值后向您赔付。</br>' +
              '5.10\t京东物流若按托寄物全部灭失进行理赔后，但托寄物尚有残值的，由京东物流与您协商处理，如残值归您所有，京东物流有权在在全部赔偿金额中直接扣减残值后向您赔付。</br>' +
              '5.11\t因下列原因造成托寄物毁损灭失、延误派送、无法派送的，京东物流不承担赔偿责任：</br>' +
              '1） 因不可抗力因素造成的。“不可抗力”是指无法预测、无法控制或无法避免的客观因素或意外事件，包括但不限于地震、火灾、雪灾、暴风雨、大雾等恶劣天气；罢工、恐怖事件、意外交通事故、法规政策的修改、政府、司法机关的行为、决定或命令；抢劫、飞车抢夺等暴力犯罪。</br>' +
              '2） 因托寄物的自然性质、内在缺陷或合理损耗造成的。</br>' +
              '3） 非京东物流过错造成的，包括但不限于客户没有如实申报托寄物资料，客户交付的托寄物属于法律法规明文规定及本合同约定禁止运输或限制运输的，客户对托运物包装不当，收货人迟延受领托寄物等情形。' },
        { text: '6、 签收' +'</br>' +
              '京东物流将快件送达收件人地址，经收件人或收件人（寄件人）允许的代收人签收，视为送达。若无收件人姓名，仅有收货单位地址，则由单位收件人员签收，或盖单位收发章，视为送达。' },
        { text: '7、 时效' +'</br>' +
              '京东物流服务产品的时效说明以京东物流官方网站上所公示的解释为准，您可以登录京东物流官方网站查询或拨打京东物流客服热线咨询。京东物流超出服务时效延误派送快件的，京东物流承担的责任仅限于免除延误快件的运费。' },
        { color: '#ff0000',text: '8、 隐私协议' +'</br>' +
              '您同意遵守京东物流官方网站所公示的隐私协议及其不时修订的内容，同意京东物流按照法律法规和隐私政策的规定处理您提供的运单信息。京东物流为保护您的个人信息，可能使用保密运单，京东物流会对您寄件时在京东物流下单系统录入的信息予以保存。对于保密运单所隐匿的信息，您同意以京东物流系统所查询的内容为准。</br>' +
              '您愿意接收京东物流以电话、电子邮件、手机短信等方式告知、发送的产品/业务介绍、推广促销信息及其他商业性信息。' },
        { text: '9、 法律适用' +'</br>' +
              '本契约条款未约定或约定不明，且双方未达成补充约定的，按照中华人民共和国相关法律法规和国家标准的规定执行。' },
        { text: '10、争议管辖' +'</br>' +
              '本条款履行过程中如发生争议，双方应友好协商解决。如协商不成的，应向快件寄出地有管辖权的人民法院提起诉讼。' },
        { text: '附录一：' +'</br>' +
              '禁止寄递物品管理规定</br>' +
              '第一条　为加强邮政行业安全管理，防止禁止寄递物品进入寄递渠道，妥善处置进入寄递渠道的违禁物品，维护寄递渠道安全畅通，促进邮政业健康发展，依据《中华人民共和国邮政法》《中华人民共和国反恐怖主义法》以及《邮政行业安全监督管理办法》等法律、行政法规和相关规定，制定本规定。</br>' +
              '第二条　在中华人民共和国境内提供和使用寄递服务活动，以及相关监督管理工作适用本规定。</br>' +
              '第三条　本规定所称禁止寄递物品（以下简称禁寄物品），主要包括：</br>' +
              '（一）危害国家安全、扰乱社会秩序、破坏社会稳定的各类物品；</br>' +
              '（二）危及寄递安全的爆炸性、易燃性、腐蚀性、毒害性、感染性、放射性等各类物品；</br>' +
              '（三）法律、行政法规以及国务院和国务院有关部门规定禁止寄递的其他物品。</br>' +
              '具体禁寄物品详见附录《禁止寄递物品指导目录》。</br>' +
              '第四条　邮政管理部门应当监督指导提供寄递服务的企业（以下简称寄递企业）落实收寄验视制度，督促企业加强寄递安全管理；监督指导寄递企业加强对从业人员的安全教育和培训；依法对寄递企业实施安全监督检查，查处违法收寄禁寄物品行为。</br>' +
              '第五条　用户交寄邮件、快件应当遵守法律、行政法规以及国务院和国务院有关部门关于禁寄物品的规定，不得交寄禁寄物品，不得在邮件、快件内夹带禁寄物品，不得将禁寄物品匿报或者谎报为其他物品交寄。</br>' +
              '第六条　寄递企业应当在其营业场所公示并以其他方式向社会公布本规定及相关指导目录。</br>' +
              '第七条　寄递企业应当建立健全安全教育培训制度，强化从业人员对禁寄物品的防范意识、辨识知识和处置能力。未经安全教育和培训的从业人员不得上岗作业。</br>' +
              '第八条　寄递企业应当严格执行收寄验视制度，依法当场验视用户交寄的物品是否属于禁寄物品，以及物品的名称、性质、数量等是否与寄递详情单所填写的内容一致，防止禁寄物品进入寄递渠道。</br>' +
              '第九条　寄递企业应当建立健全安全检查制度，配备符合国家标准或者行业标准的安全检查设备，安排具备专业技术和技能的人员对邮件、快件进行安全检查。</br>' +
              '第十条　寄递企业应当制定禁寄物品处置预案，根据情况变化及时修订，并向邮政管理部门备案。寄递过程中发现禁寄物品的，应当按照预案规定妥善处置。</br>' +
              '第十一条　寄递企业完成收寄后发现禁寄物品或者疑似禁寄物品的，应当停止发运，立即报告事发地邮政管理部门，并按下列规定处理：</br>' +
              '（一）发现各类枪支（含仿制品、主要零部件）、弹药、管制器具等物品的，应当立即报告公安机关；</br>' +
              '（二）发现各类毒品、易制毒化学品的，应当立即报告公安机关；</br>' +
              '（三）发现各类爆炸品、易燃易爆等危险物品的，应当立即疏散人员、隔离现场，同时报告公安机关；</br>' +
              '（四）发现各类放射性、毒害性、腐蚀性、感染性等危险物品的，应当立即疏散人员、隔离现场，同时视情况报告公安、环境保护、卫生防疫、安全生产监督管理等部门；</br>' +
              '（五）发现各类危害国家安全和社会稳定的非法出版物、印刷品、音像制品等宣传品的，应当及时报告国家安全、公安、新闻出版等部门；</br>' +
              '（六）发现各类伪造或者变造的货币、证件、印章以及假冒侵权等物品的，应当及时报告公安、工商行政管理等部门；</br>' +
              '（七）发现各类禁止寄递的珍贵、濒危野生动物及其制品的，应当及时报告公安、野生动物行政主管等部门；</br>' +
              '（八）发现各类禁止进出境物品的，应当及时报告海关、国家安全、出入境检验检疫等部门；</br>' +
              '（九）发现使用非机要渠道寄递涉及国家秘密的文件、资料及其他物品的，应当及时报告国家安全机关；</br>' +
              '（十）发现各类间谍专用器材或者疑似间谍专用器材的，应当及时报告国家安全机关；</br>' +
              '（十一）发现其他禁寄物品或者疑似禁寄物品的，应当依法报告相关政府部门处理。</br>' +
              '第十二条　邮政管理部门接到寄递企业发现禁寄物品的报告后，应当按规定向上级部门报告，并视情况联合公安、国家安全、卫生防疫、海关、检验检疫、新闻出版、工商行政管理、安全生产监督管理、野生动物行政主管等部门相互配合、依法处置。</br>' +
              '第十三条　禁寄物品指导目录由国务院邮政管理部门会同有关部门确定、公布，并适时调整。</br>' +
              '第十四条　对及时发现、报告禁寄物品，维护国家安全、公共安全和人民生命财产安全，或者有效避免、减少寄递安全事故的单位和个人，邮政管理等部门可依法给予表彰。</br>' +
              '第十五条　寄递企业违法收寄禁寄物品的，邮政管理部门依照《中华人民共和国邮政法》《中华人民共和国反恐怖主义法》等法律、行政法规的规定予以处罚。</br>' +
              '第十六条　用户违反本规定，在邮件、快件内夹带禁寄物品，将禁寄物品匿报或者谎报为其他物品交寄，造成人身伤害或者财产损失的，依法承担赔偿责任；构成犯罪的，依法追究刑事责任；尚不构成犯罪的，依照《中华人民共和国治安管理处罚法》及有关法律、行政法规的规定处罚。</br>' +
              '第十七条　本规定自发布之日起施行。国家邮政局2007年11月6日发布的《禁寄物品指导目录及处理办法（试行）》（国邮发〔2007〕152号）同时废止。' },
        { text: '附录二：' +'</br>' +
              '禁止寄递物品指导目录</br>' +
              '一、枪支（含仿制品、主要零部件）弹药</br>' +
              '1．枪支（含仿制品、主要零部件）：如手枪、步枪、冲锋枪、防暴枪、气枪、猎枪、运动枪、麻醉注射枪、钢珠枪、催泪枪等。</br>' +
              '2．弹药（含仿制品）：如子弹、炸弹、手榴弹、火箭弹、照明弹、燃烧弹、烟幕（雾）弹、信号弹、催泪弹、毒气弹、地雷、手雷、炮弹、火药等。</br>' +
              '二、管制器具</br>' +
              '1．管制刀具：如匕首、三棱刮刀、带有自锁装置的弹簧刀（跳刀）、其他相类似的单刃、双刃、三棱尖刀等。</br>' +
              '2．其他：如弩、催泪器、催泪枪、电击器等。</br>' +
              '三、爆炸物品</br>' +
              '1．爆破器材：如炸药、雷管、导火索、导爆索、爆破剂等。</br>' +
              '2．烟花爆竹：如烟花、鞭炮、摔炮、拉炮、砸炮、彩药弹等烟花爆竹及黑火药、烟火药、发令纸、引火线等。</br>' +
              '3．其他：如推进剂、发射药、硝化棉、电点火头等。</br>' +
              '四、压缩和液化气体及其容器</br>' +
              '1．易燃气体：如氢气、甲烷、乙烷、丁烷、天然气、液化石油气、乙烯、丙烯、乙炔、打火机等。</br>' +
              '2．有毒气体：如一氧化碳、一氧化氮、氯气等。</br>' +
              '3．易爆或者窒息、助燃气体：如压缩氧气、氮气、氦气、氖气、气雾剂等。</br>' +
              '五、易燃液体</br>' +
              '如汽油、柴油、煤油、桐油、丙酮、乙醚、油漆、生漆、苯、酒精、松香油等。</br>' +
              '六、易燃固体、自燃物质、遇水易燃物质</br>' +
              '1．易燃固体：如红磷、硫磺、铝粉、闪光粉、固体酒精、火柴、活性炭等。</br>' +
              '2．自燃物质：如黄磷、白磷、硝化纤维（含胶片）、钛粉等。</br>' +
              '3．遇水易燃物质：如金属钠、钾、锂、锌粉、镁粉、碳化钙（电石）、氰化钠、氰化钾等。</br>' +
              '七、氧化剂和过氧化物</br>' +
              '如高锰酸盐、高氯酸盐、氧化氢、过氧化钠、过氧化钾、过氧化铅、氯酸盐、溴酸盐、硝酸盐、双氧水等。</br>' +
              '八、毒性物质</br>' +
              '如砷、砒霜、汞化物、铊化物、氰化物、硒粉、苯酚、汞、剧毒农药等。</br>' +
              '九、生化制品、传染性、感染性物质</br>' +
              '如病菌、炭疽、寄生虫、排泄物、医疗废弃物、尸骨、动物器官、肢体、未经硝制的兽皮、未经药制的兽骨等。</br>' +
              '十、放射性物质</br>' +
              '如铀、钴、镭、钚等。</br>' +
              '十一、腐蚀性物质</br>' +
              '如硫酸、硝酸、盐酸、蓄电池、氢氧化钠、氢氧化钾等。</br>' +
              '十二、毒品及吸毒工具、非正当用途麻醉药品和精神药品、非正当用途的易制毒化学品</br>' +
              '1．毒品、麻醉药品和精神药品：如鸦片（包括罂粟壳、花、苞、叶）、吗啡、海洛因、可卡因、大麻、甲基苯丙胺（冰毒）、氯胺酮、甲卡西酮、苯丙胺、安钠咖等。</br>' +
              '2．易制毒化学品：如胡椒醛、黄樟素、黄樟油、麻黄素、伪麻黄素、羟亚胺、邻酮、苯乙酸、溴代苯丙酮、醋酸酐、甲苯、丙酮等。</br>' +
              '3．吸毒工具：如冰壶等。</br>' +
              '十三、非法出版物、印刷品、音像制品等宣传品</br>' +
              '如含有反动、煽动民族仇恨、破坏国家统一、破坏社会稳定、宣扬邪教、宗教极端思想、淫秽等内容的图书、刊物、图片、照片、音像制品等。</br>' +
              '十四、间谍专用器材</br>' +
              '如暗藏式窃听器材、窃照器材、突发式收发报机、一次性密码本、密写工具、用于获取情报的电子监听和截收器材等。</br>' +
              '十五、非法伪造物品</br>' +
              '如伪造或者变造的货币、证件、公章等。</br>' +
              '十六、侵犯知识产权和假冒伪劣物品</br>' +
              '1．侵犯知识产权：如侵犯专利权、商标权、著作权的图书、音像制品等。</br>' +
              '2．假冒伪劣：如假冒伪劣的食品、药品、儿童用品、电子产品、化妆品、纺织品等。</br>' +
              '十七、濒危野生动物及其制品</br>' +
              '如象牙、虎骨、犀牛角及其制品等。</br>' +
              '十八、禁止进出境物品</br>' +
              '如有碍人畜健康的、来自疫区的以及其他能传播疾病的食品、药品或者其他物品；内容涉及国家秘密的文件、资料及其他物品。</br>' +
              '十九、特殊物品</br>' +
              '（1）玻璃类（如灯管、灯泡等玻璃制品）、陶瓷类、石膏类，以及不易妥善包装的物品；如：玉雕、木雕艺术品等；</br>' +
              '（2）工艺品、古董、瓷器、玉器、字画、珠宝、有价证券等难以客观确认价值的货物；</br>' +
              '（3）医药类物品：无完整销售包装，药品有温度等特殊要求等；医学检测类物品不作揽收；</br>' +
              '（4）活体动物；</br>' +
              '（5）现金及货币；</br>' +
              '（6）国家机关公文；</br>' +
              '二十、其他物品</br>' +
              '《危险化学品目录》《民用爆炸物品品名表》《易制爆危险化学品名录》《易制毒化学品的分类和品种目录》《中华人民共和国禁止进出境物品表》载明的物品和《人间传染的病原微生物名录》载明的第一、二类病原微生物等，以及法律、行政法规、国务院和国务院有关部门规定禁止寄递的其他物品。' },
        { text: '附录三：' +'</br>' +
              '空运违禁品寄递物品指导目录</br>' +
              '一、植物类</br>' +
              '花木/草/树等各种植物,鲜花等</br>' +
              '二、易燃易爆物品</br>' +
              '喷雾器,自喷漆,导火索,鞭炮/礼炮,发令纸,火药,拉炮,雷管,礼花,煤气罐,煤气瓶,摔炮,烟火制品,烟花,爆竹,炸药,密封罐,石油,溶剂油,汽油,煤油,柴油,石蜡,沥青等</br>' +
              '三、易腐蚀</br>' +
              '电池液（酸性的）,苛性钠,汽车用蓄电池,无机液体粘合剂,酸铅蓄电池,王水等</br>' +
              '四、医疗用品及药品</br>' +
              '血液/血浆,血液循环器,血液流动测试器,胶囊,药品,碘酒,试剂,疫苗,医药试剂,鹿茸粉,鹿茸（新鲜鹿茸）,医疗仪器,氧气随身瓶,医用氧气瓶等</br>' +
              '五、液体类</br>' +
              '饮料饮品,矿泉水,冰茶,奶茶,可乐,果粒橙,汽水,红牛,雪碧,苏打水,冷鲜奶,酸奶,奶昔,苹果醋,冰沙,果汁,豆奶,豆浆,牛奶,红茶,绿茶,柚子茶,蜂蜜,着色剂,水,不明液体等</br>' +
              '六、香烟类</br>' +
              '烟叶,烟丝,香烟等</br>' +
              '七、文体用品</br>' +
              '足球,篮球,排球,皮球,网球,高尔夫球,橄榄球,胶片,弓箭,仿真玩具枪,墨粉盒,碳带,打印机碳带,玩具枪,模型枪,印泥,公章,空弹壳工艺品,美工刀,美工刀片,玩具刀,模型刀,乒乓球等</br>' +
              '八、水果类</br>' +
              '榴莲,菠萝蜜,杨梅,荔枝,葡萄,无花果,提子,蓝莓,柿子,青梅,鲜枸杞,鲜百合,桑葚,李子,杏,枇杷,车厘子,草莓,樱桃,猕猴桃,鲜枣,水蜜桃,金桔,哈密瓜,西瓜等</br>' +
              '九、食品类</br>' +
              '乳制品,炼乳,奶油,干酪类,乳糖,乳清粉,动物饲料,粽子,冰冻食品,奶精,罐头食品,调味料/调料,食盐,白糖,味精,白醋,生姜,大蒜,虾夷葱,香芹等</br>' +
              '十、生鲜类</br>' +
              '蚕蛹,菌类/菇类,各种肉制品,鸡翅,茧蛹,鸡爪/凤爪,牛排,鲜海参,虾类（大龙虾、海虾、河虾）,龟（无生命特征）,石螺,蛤蜊,生蚝,青口/带子/鲜贝,海螺,牡蛎,蚬子,冷冻贝类,各种肉类,松茸,鸭脖,知了（非活物）,鲜鱼籽,甲鱼,蟹类（大闸蟹、河蟹、海蟹等）,冷冻鱼类（野生鲍鱼、鱿鱼、八爪鱼、三文鱼、淡水鱼、海鱼、泥鳅等）,海螺,生蚝等</br>' +
              '十一、日化用品</br>' +
              '腮红,保湿水,眼线液,防晒油,眼影,隐形眼镜护理液,眼药水,生理食盐水,防蚊液,花露水,染发剂,洗发剂,烫发剂,直发剂,定型剂,焗油膏,护发乳,发膜/发蜡,指甲油等</br>' +
              '十二、气体类</br>' +
              '充气娃娃,水煤气,救生衣,婚庆礼花筒,灯泡,灯管,节能灯,灯管,疝气灯等</br>' +
              '十四、酒类</br>' +
              '啤酒,葡萄酒,药酒,红酒,自酿酒/散酒,白酒,洋酒等</br>' +
              '十五、家饰、家电</br>' +
              '空调、冰箱等压缩机,电音响/音箱,床垫</br>' +
              '十六、机械类</br>' +
              '整装汽车,点火系统,千斤顶,液压钳,液压工具</br>' +
              '十七、化学物品</br>' +
              '石油树脂,疏浚泥,热熔胶,漂白剂,防滑剂,肥料,尿素,水泥,软化剂,热熔胶条等</br>' +
              '十八、膏状物类</br>' +
              '硅胶,玻璃胶,皮革清洁膏,皮衣护理油膏,电子数码管石墨乳等</br>' +
              '十九、粉末类/颗粒类</br>' +
              '塑料粒,滑石粉,石膏粉,色粉,奶粉/乳粉,咖啡粉/卡布奇诺,蛋白粉/蛋白质粉,干燥剂,其他粉末,其他颗粒,木炭粉,除湿剂,除湿颗粒,粉状物,鱼粉,去污粉等</br>' +
              '二十、放射性的物品及各种危险品</br>' +
              '放射线物质, 夜光粉铈-114,钚-239,锶-90,碘-131,铯-137,钌-106,铑-106,铁-55,锰-54,锌-65,钴-60,等</br>' +
              '二十一、电子产品类</br>' +
              '电子表,行车记录仪,电脑,相机,摄像机,VCD,SVCD,DVD,录像机,摄录机,收音机,收录机,电唱机,激光唱机/CD,家庭办公设备,家用电子保健设备,汽车电子产品,复读机,点读机,电子辞典/掌上电脑,游戏机,光碟,录像带,蓝牙耳机,电动剃须刀,电子蜡烛,点烟器,机箱电源,激光电源,计算器冷却器,电子烟,移动电源/充电宝,三星GALAXY NOTE 7</br>' +
              '二十二、电池类</br>' +
              '手机,蓄电池,碱性的电池液,化学电池,液体电池,铅酸电池,燃料电池等</br>' +
              '二十三、工具刀具类</br>' +
              '黄油枪,手用锯条,钢锯,电钻,轮胎充气泵、剃须刀片,水果刀,菜刀,餐具类刀具,餐具刀叉,军刀,日本军刀,指挥刀,瑞士军刀,剪刀,园艺剪刀,高枝剪刀,园林修枝剪刀等</br>' +
              '二十四、磁性物品</br>' +
              '磁条,磁铁,喇叭,门铃,其他带磁物品,音响/音箱,电磁铁,四氧化三铁,电磁铁等' },
        { text: '附录四：' +'</br>' +
              '增值服务附件——代收货款服务协议</br>' +
              '本服务条款是基于寄件人（以下或简称您）与京东物流达成《快件服务协议》，并就代收货款增值服务达成的补充协议（以下简称本服务条款），<sapn style="color: #ff0000">请您仔细阅读，若你选择使用代收货款服务即受本服务条款约束，若您未选择使用代收货款服务，不受本服务条款约束。</sapn>京东物流有权对本协议内容进行变更，若您在本协议内容变更后继续使用本服务，表示您已充分阅读、理解并接受修改后的条款内容；若您不同意本协议或修改后的条款内容，您应停止使用本服务。</br>' +
              '1、 说明</br>' +
              '1.1“京东物流”指北京京邦达贸易有限公司及其关联公司，并依据本协议为您提供代收货款服务。本协议的缔约主体是您与寄件地的北京京邦达贸易有限公司的子公司、分公司、关联公司。</br>' +
              '1.2  代收货款服务是指京东物流按照您与收件人之间达成的交易协议，向您提供快递服务同时并代您向收件人收取货款，并按照双方约定时间将货款返至您指定账户，同时向您收取代收货款服务费的增值服务。</br>' +
              '2、 寄件人权利与义务</br>' +
              '2.1 您委托京东物流代收货款的托寄物须符合国家法律规定、合法销售、承担质量保证及售后服务承诺义务。您因托寄物与收件人或第三方之间发生的交易纠纷由发生争议的双方自行解决。您未妥善解决纠纷，导致收件人或第三方对托寄物采取保全措施（如扣留托寄物）而造成的损失由您承担，如给京东物流造成损失的，您应负责赔偿。</br>' +
              '2.2 您委托京东物流代为收取货款的，须在面单上清晰、准确的填写收款信息且确保其与实际需代收货款金额一致。您委托京东物流提供所代收货款服务的快件每份面单对应的代收货款金额不超过人民币30万元。因第三方原因导致京东物流未完成代收款工作的，京东物流应及时向您反馈情况并积极协助您向付款义务人追讨。</br>' +
              '2.3 收件人在付款前有权拆开包装对货物外观及数量检验，如收件人在验货后决定拒绝接受托寄物或者拒绝付款的，您不得以收件人曾拆开包装为由拒绝收回货物，亦不得以此为由追究京东物流的任何责任，同时，京东物流按您要求逆向退回的，由您承担退回的运费。</br>' +
              '2.4 您与收件人或第三方存在买卖等商业交易关系的，收件人或第三方对于托寄物提出售后等相关问题，或基于有关法律法规及合同约定要求退换托寄物的及/或提出退款申请的，您应积极与收件人或第三方协商处理并达成一致。如您未及时处理，导致收件人或第三方投诉至京东物流，自京东物流通知您后5日内仍未妥善处理的，或收件人或第三方投诉对京东物流名誉或品牌造成威胁或损害的（以京东物流判断为准），京东物流有权代您退款。但并不表示京东物流对您的商品的质量保证及其售后服务承担责任，京东物流仅对托寄物寄递、代收货款等物流服务负责。针对该情形下的退货的运费由您承担，但您与退货方协商一致由退货方承担的除外。</br>' +
              '2.5 应指定人员负责与京东物流进行对接，负责处理与京东物流日常事务对接、及时处理投诉至京东物流的您与收件人或第三方的售后服务等交易纠纷。</br>' +
              '2.6 京东物流已安排两次配送，但由于非京东物流原因（包括但不限于收件人拒收、联系不上收件人、收件人信息有误等）造成仍未成功妥投的托寄物的，您如需京东物流提供再次投递服务的，满足条件后可选择京东物流协商再投收费增值服务。</br>' +
              '2.7 您已知悉并确认，使用快递面单上寄件人联系方式、双方协议或您书面授权的联系方式、您在京东物流系统登记的联系方式向京东物流提出取消或更改托寄物代收货款金额的需求，视为您授权行为，因此产生的电话录音、电子邮件、系统操作等均视为您取消或更改代收货款金额的依据。</br>' +
              '2.8 合同有效期内，您月平均妥投率未达到50%的，京东物流给予三个月整改期后，您仍未达到标准，京东物流有权选择调整服务收费标准或终止合作。</br>' +
              '3、代收货款服务费与结算</br>' +
              '3.1 代收货款的结算：</br>' +
              '乙方有权向甲方收取代收货款服务费，甲方同意乙方直接从代收货款中扣除服务费。</br>' +
              '3.2 代收货款服务费标准：甲方同意按照京东物流官方网站上公布（www.jdwl.com）的费用标准向乙方支付相应的服务费用。甲方同意乙方有权根据经营需要对官网价格进行调整，并按照最新价格进行结算。</br>' +
              '3.3 结算周期：支持“T+ 3”返款方式，双方对账完成后进行返款，如遇节假日返款时间顺延。</br>' +
              '3.4 您应在系统中填写您的代收货款返款接收账户：</br>' +
              '▲您应保证其提供的户名、开户银行、账号等信息真实准确，如您账号变更或发生不可用等情况出现时，您应及时书面通知京东物流并确认京东物流获悉，否则因此引起的延期付款、转账错误或无法转账，京东物流不承担任何责任，若因此造成京东物流损失的，您应当赔偿京东物流损失。</br>' +
              '▲您代收货款返款接收账户应为您本人的对公账户；如您指定代收货款返款账户非您对公账户，需出具授权书说明收款账户与您的关系。 </br>' +
              '3.5 京东物流有权自应付您代收货款中扣除您未支付物流服务费、京东物流代您退款费用、违约金等费用后，将剩余款项支付您。如您代收返还货款不足以抵扣上述费用时，您需另行向京东物流支付。</br>' +
              '4、其他</br>' +
              '本协议未涉及的内容，仍按您与京东物流达成《快件服务协议》的约定执行。' },
      ]
    }
  },
  methods:{
    btnTips() {
      this.$emit('change')
      this.show = false
    }
  }
}
</script>

<style scoped>
.content{
  height: 500px;
  padding: 0.2rem 1rem 2rem;
  font-size: 0.9rem;
}
.content_text:last-child{
  padding-bottom: 5rem;
}
.footer{
  bottom: 0;
  position: fixed;
  width: 100%;
  height: 50px;
  background: #f6f6f6;
  left: 0px;
  display: flex;
  line-height: 50px;
  padding-left: 20px;
  padding-right: 20px;
  box-sizing: border-box;
  justify-content: space-between;
}

.confirm_tips {
  display: flex;
  font-size: 0.8rem;
  color: #666666;
  padding: 0px;
}
.btn-tips {
  margin-top: 25px;
  transform: translate(0, -50%);
  line-height: 12px;
  color: #ffffff;
  width: 14px;
  height: 14px;
  border-radius: 50%;
  border: 1px solid #333333;
  margin-right: 5px;
}

.btn-tips-true {
  margin-top: 25px;
  transform: translate(0, -50%);
  line-height: 12px;
  color: #ffffff;
  width: 14px;
  height: 14px;
  border-radius: 50%;
  border: 1px solid #409eff;
  margin-right: 5px;
  background: #409eff;
}

</style>